Revit 2027 API
SchedulableField(Guid) Constructor
 Creates a new SchedulableField.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SchedulableField(
	Guid customFieldId
)
Public Sub New (
	customFieldId As Guid
)
public:
SchedulableField(
	Guid customFieldId
)
new :
        customFieldId : Guid -> SchedulableField
Parameters
customFieldId Guid
 The Guid that identifies the custom field.
Exceptions
Exception | Condition
ArgumentException |  The provided guid doens't represent a valid custom field.
See Also
Reference
SchedulableField Class
SchedulableField Overload
Autodesk.Revit.DB Namespace